
var status = 0;

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    cm.sendOk("《大悲心陀羅尼經》中，佛陀告訴阿難尊者說：「如是神咒，有種種名：一名廣大圓滿、一名無礙大悲、一名救苦陀羅尼、一名延壽陀羅尼、一名滅惡趣陀羅尼、一名破惡業障陀羅尼、一名滿願陀羅尼、一名隨心自在陀羅尼、一名速超十地陀羅尼。」此咒名稱彰顯了觀世音菩薩欲安樂利益一切眾生之廣大圓滿、無礙大悲的大悲願力，及此咒不但能除一切災難、以及諸惡業病苦；且能成就一切善法、隨心滿願；遠離一切怖畏、速登佛地的威神特德。今人以《大悲咒》簡稱之，取之觀世音菩薩慈披眾生之大悲願力而命名。此咒由過去九十九億恆河沙劫諸佛所宣說，後於千光王靜住如來的淨土時，千光王靜住如來為觀世音菩薩傳授「廣大圓滿無礙大悲陀羅尼」，並且對他說：「善男子汝當持此心咒，普為未來惡世一切眾生作大利樂。」。當時觀世音菩薩聽了此咒之後，即由初地菩薩，升至第八地不動地菩薩果位。於是心生歡喜發出誓願說：「設我當來之世能利樂一切眾生者，令我即時身生千手千眼具足。」如此發願後，果真頓時身生千手千眼，並且十方大地都為之震動，十方諸佛亦都放出無量光明，遍照十方無邊世界。");
    cm.dispose();
}