var status = 0;

function start() {
	cm.sendOk ("您好，現在為您介紹卡納遊樂園說明\r\n#b如您是參與【召喚超級番茄】可有機率獲得\r\n#r蕃茄帽子(力量)、蕃茄帽子(敏捷)、蕃茄帽子(智力)、蕃茄帽子(幸運)、番茄套服、番茄衣服、番茄帽子\r\n#b如您是參加【BOSS挑戰】則可獲得黃金楓葉。\r\n#r可向雪靈兌換。\r\n#b如您是參與【召喚黃金豬】\r\n#r有高機率掉落眾多高價值道具。\r\n#b如您是參與【召喚蛋糕】\r\n#r進入地圖後，有高機率掉落各種補品。\r\n#b如您是參與【驚喜寶箱】\r\n#r摧毀寶箱會掉落各類虛寶，轉蛋卷、補品、各類卷軸、兵法書、召喚包。\r\n#b如您是參與【召喚魚王】\r\n#r擊殺後可獲得經驗值十萬、及各類兵法書。\r\n#b如您是參與【特殊忍耐地圖】\r\n#r通過挑戰可獲得 點數 100 點 、 楓幣 5 萬。\r\n#b如您是參與【挑戰被主咒的黑貓】\r\n#r通過挑戰可有高機率掉落各類技能書。")
		}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 1)
			status++;
		else
			status--;
}
}
